10/24 9：30 薛
功能实现说明：
已实现：登入、注册的功能：包括连接数据库、查询数据库；
	登入、注册的异常处理：检测用户名、密码的逻辑，用户名是否已、两次输入密码是否一致，并给出提示（采用alert实现，如需修改请再加上其他的样式）
未实现：登入、注册的用户名、密码的规格检测（需要用到ajax技术）
解决修改：主页面图片显示问题、以及主页面左侧菜单栏显示代码问题
10/24 10:40 薛
改进说明：
用替代方法勉强实现验证：输入框失去焦点+文本隐藏display
已实现：输入框失去焦点+alert实现
10/24 12:00
改进说明：
已实现：修改了jsp、java文件说名，注释等规范
	并将“输入框失去焦点+alert实现”运用到所有的登入、注册里面

10/24 12:20 陈甜
功能实现说明：
	登录和注册界面的用户名输入提醒，密码输入提醒。

10/24 15：00 薛
修改：修改了包名，项目名

10/26 9:32
修改： applicationContext.xml:添加了register/login的Bean
	struts.xml:减少了Action的绝对路径
	register.jsp:改正了register的命名
	
11/1 10:00 薛
修改：添加了dwr框架
		为此修改了了注册、登入的提示模式，在userDao中好像添加了findUser(String user)重载
		
11/04 19:00
blablablablabla